import React from 'react';
import './About.css';

const BobaFett = () => (
    <div className="container">
        <h1>Боба Фетт</h1>
        <div className="image">
            <img 
                src="https://static1.cbrimages.com/wordpress/wp-content/uploads/2021/12/Boba-Fett-header.jpg" 
                alt="Боба Фетт"
            />
        </div>
        <div className="character-info">
            <p><strong>Боба Фетт</strong> – відомий мисливець за головами у всесвіті «Зоряних війн», клон свого батька Джанго Фетта, якого він вважав своїм справжнім батьком. Боба виріс, щоб стати одним із найстрашніших і найвправніших найманців.</p>
        </div>

        <h2>Основні факти:</h2>
        <p>Народився: 32 ДБЯ.</p>
        <p>Рідна планета: Каміно.</p>
        <p>Боба Фетт був частиною багатьох ключових подій у Галактиці, включаючи війну клонів, і працював на таких відомих осіб, як Джабба Гатт і Дарт Вейдер.</p>

        <h2>Історія:</h2>
        <p>Боба був створений на планеті Каміно, як частина замовлення Джанго Фетта, щоб виховати його як сина. Після смерті Джанго під час битви на Геонозисі, Боба виріс, навчаючись бути мисливцем за головами. Його історія включає виживання у ямі Сарлакка і подальше повернення до кримінального світу галактики.</p>
    </div>
);

export default BobaFett;
