import React from 'react';
import './Contact.css';

const Contact = () => (
    <div className="container">
        <h1>Рей Скайвокер</h1>
        <div className="image">
            <img 
                src="https://s.yimg.com/ny/api/res/1.2/wS04JRWwst8.IOiq71yueQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTY0MDtoPTQyNw--/https://media.zenfs.com/es/tomatazos_56/e3976cf0f42206dc153c651bb04cbfa8" 
                alt="Рей Скайвокер"
            />
        </div>
        <div className="character-info">
            <p><strong>Рей Скайвокер</strong> – джедайка, яка зіграла важливу роль у боротьбі проти Першого ордену та у відродженні Ордену джедаїв. Вона була дочкою невідомих батьків, але пізніше дізналася, що є онукою імператора Палпатіна.</p>
        </div>

        <h2>Основні факти:</h2>
        <p>Народилася: 15 ПБЯ.</p>
        <p>Рідна планета: Джакку.</p>
        <p>Рей змогла об'єднати у собі силу свого роду та спадок джедаїв, здолавши свого діда Палпатіна і відновивши мир у Галактиці.</p>

        <h2>Історія:</h2>
        <p>Рей була залишена батьками на планеті Джакку у ранньому дитинстві, де вона виросла, ставши самотньою збирачкою металобрухту. Її подорож як джедая почалася після зустрічі з Люком Скайвокером. Пізніше вона дізналася про своє походження і відіграла ключову роль у відродженні Ордена джедаїв.</p>
    </div>
);

export default Contact;
